'''в переменную записывается возвращаемое значение функции - выборки. '''
# удалил комментарий 4. Шум

'''‘safe’ means only casts which can preserve values are allowed.'''
# удалил комментарий, дублриующий документациж 7. Избыточный комментарий

'''
train_begin
train_end
'''
# 5. позиционный маркер блока кода для формирования исполняемого файла. не использую формирование исполняемого файла.

"""
/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putchar.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: evgenkarlson <RTFM@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/14 12:33:14 by evgenkarlson      #+#    #+#             */
/*   Updated: 2021/02/16 23:27:33 by evgenkarlson     ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */
"""
# 5. позиционный маркер, бывший обязательным в школе21 в начале каждого файла
# перестал использовать, т.к. давно не учусь

"""
"""
# 11. удалил 4 случая закомментированного альтернативного кода: "запасные" архитектуру модели, "запасную" математическую формулу, "запасную" версию класса в проекте интерфейса.

"""
// объявляем объект File класса QFile, являющийся "дескриптором" открываемого файлв
"""
# удалил комментарий 4. Шум


'''// применяем к объекту File метод open для его открытия в режиме только чтения (readonly)'''
# удалил комментарий 4. Шум

'''// // // Конец блока (копировано с https://ru.stackoverflow.com/questions/1299505/Все-сочетания-из-n-по-k и подстроено для текущих нужд)'''
# удалил комментарий 4. Шум и 8. Слишком много информации и 5. Позиционные маркеры

'''// Для рисования используем события мыши'''
# удалил комментарий 4. Шум

'''// Добавляем переменную (и не только её), следящую за комбинациями нажатий на ЛКМ'''
# удалил комментарий 2. Бормотание и 4. Шум

'''
//    const float window_width = 782.0, // базовые длины сторон для ..
//                window_height = 498.0, // .. ф-ии fininview
//    // и добавим привязку геокоординат к углам фото:
//                left_B = 71.787975, // широта левого верхнего угла
//                left_L = -14.39963, // долгота левого верхнего угла
//                right_B = 37.106893, // то же
//                right_L = 90.937283; // в правом нижнем углу'''
# исправил названия переменных. 10. Обязательные комментарии


'''
// // блок ввода параметров генетического алгоритма
//*    QVector<double> Params_GA = {500, 80, 20.0, 3, 0.95, 0, 0.1, 20.0}; // параметры по умолчанию
// кодировка: QVector<> Params_GA: 1. количество особей в популяции, 2. макс. кол-во поколений, 3. процент элитных особей,
// 4. тип отбора, 5. вероятность скрещивания, 6. тип мутации, 7. вер. мутации, 8. сила мутации
// //
// 4. 0 - рулетка, 1 - стохастическая универслаьная выборка (SUS), 2 - ранжированный отбор, 3 - турнирный отбор
// 6. 0 - мутация обменом, 1 - мутация обращением, 2 - мутация перетасовкой

// Функция "полуинтерфейса" в виде консольного меню

//Params_GA = menu_params_GA(Params_GA);

// //


// // // ДЛЯ УСКОРЕНИЯ ОЦЕНКИ ПУТЁМ ВЗЯТИЯ ДАННЫХ О ПЕРЕСЕЧЕНИИ ЗЗП СОСТАВЛЯЕМ АНАЛОГИЧНЫЕ (точному методу) ТАБЛИЦЫ ПОРАЖАЕМОСТИ

// ТАБЛИЦА ПОРАЖАЕМОСТИ в данном случае СЛОЕВАЯ:
// 1 (0) слой - поражаемость по признаку попадания цели в зону поражаемости АО
// 2 (1) слой - по признаку попадания цели в ЗЗП
// 3 (2) слой - по признаку пролёта ракеты по пути к цели через ЗЗП
// таблица бинарная - "1" - всё хорошо (поражается, не попадает в зоны и т.д.), "0" - иначе

// %%% Таблица поражения первоочерёдных целей (ввод и заполнение).
// По умолчанию выставляется единица для всех слоёв
'''
# 7. Избыточные комментарии 8. Слишком много информации  и 9. Нелокальная информация